/**************************************************************************************
*		              DA-PWM输出实验												  *
实现现象：下载程序后DA模块上的指示灯呈呼吸灯效果，由暗变亮再由亮变暗
注意事项：要将AD/DA模块上的短接片将OUT和LED短接，板子丝印上有。
		  如果不想让点阵模块显示，可以将74HC595模块上的JP595短接片拔掉。																				  
***************************************************************************************/

#include <STC12C5A60S2.H>		 //此文件中定义了单片机的一些特殊功能寄存器
#include "pwm.h"


typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

//--定义使用的IO口--//
sbit PWM=P2^1;
sbit PTST = P2^0;

void delay(u16 i){
    while(i)i--;
}

void main()
{	
    u8 i = 0;
    pwm_init();
    //P2
    P2M1 = 0xff;
    P2M0 = 0x00;
    //P1.5
    P1M1 |= 0x01<<5;
    P1M0 &= 0x01<<5;
    
    
    
    
    while(1){
        if(i<255){i++;}else{i=0;}
        pwm_set(i,i);
        delay(50);
    }
}
